app/Controllers/Mahasiswa.php

    public function index()
    {
        $data = $this->mahasiswaModel->findAll();
---
SELECT *
FROM `mahasiswa`

    public function create()
    {
        $rules = [
            'nama' => 'required',
            'nim' => 'required',
            'gambar' => 'is_image[gambar]'
        ];

        if (!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        }else{

            $gambar = $this->request->getFile('gambar');
            if (!$gambar->isValid()) {
                return $this->fail($gambar->getErrorString());
            }

            $gambar->move('test/api');

            $data = [
                'nama' => $this->request->getVar('nama'),
                'nim' => $this->request->getVar('nim'),
                'gambar' => $gambar->getName()
            ];
            $this->mahasiswaModel->insert($data);
---
INSERT INTO `mahasiswa` (`nama`, `nim`, `gambar`) VALUES ('vitos', '4611420039s', 'Screenshot (2)_1.png')

                    return $this->fail($gambar->getErrorString());
                }

                $gambarLama = $this->mahasiswaModel->where('id', $id)->first();
---
SELECT *
FROM `mahasiswa`
WHERE `id` = '4'
 LIMIT 1

                $data['gambar'] = $gambar->getName();
            }

            $this->mahasiswaModel->save($data);
---
UPDATE `mahasiswa` SET `nama` = 'vitoss', `nim` = 'vitoss', `gambar` = 'Screenshot (2)_2.png'
WHERE `mahasiswa`.`id` IN ('4')

    public function show($id = null)
    {
        $data = $this->mahasiswaModel->where('id', $id)->first();
---
SELECT *
FROM `mahasiswa`
WHERE `id` = '2'
 LIMIT 1

    public function delete($id = null)
    {

        $data = $this->mahasiswaModel->where('id',$id)->first();
        $gambar = $data['gambar'];
        if (!$data) {
            return $this->fail('data mungkin sudah tidak ada atau sudah diubah');
        }else{
            unlink('test/api/'. $gambar);
            $data = $this->mahasiswaModel->delete($id);
---
SELECT *
FROM `mahasiswa`
WHERE `id` = '4'
 LIMIT 1
DELETE FROM `mahasiswa`
WHERE `id` IN ('4')